{"path":"blog/toile-araignée","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"Radar, araignée, polaire ou Kiviat","slug":"toile-araignée","contents":"<h1 id=\"diagramme-en-toile-d-araign-e\">Diagramme en toile d&#39;araignée</h1>\n<p>Toile d&#39;araignée, radar, polaire ou Kiviat, il a beaucoup de noms.\nJe remarque que ce diagramme exerce un pouvoir d&#39;attraction très significatif. Beaucoup de personnes avec qui je discute (clients, stagiaires ou simples contacts) regarde ce diagramme avec beaucoup d&#39;envie et de respect. Et quand vient le moment où l&#39;on me demande mon avis, je suis embarrassé pour faire une réponse courte.</p>\n<center>\n<img src=\"/files/2014.png\" alt=\"\">\n\n<p><strong>Bonne Année 2014</strong></p>\n</center>\n\n<h3 id=\"sa-forme-circulaire-sa-fonction-naturelle\">Sa forme circulaire, sa fonction naturelle</h3>\n<p>Sa forme en cercle se prête naturellement à la représentation de données qui après avoir fait un tour complet reviennent ... à leur point de départ. \nDeux cas évidents d&#39;application:</p>\n<ul>\n<li>l&#39;espace: sources sonores, champs visuel, direction du vent, ...</li>\n<li>le temps et ses cycles: les heures de la journée, les jours de la semaine, les mois de l&#39;année.</li>\n</ul>\n<h3 id=\"sa-capacit-visualiser-plusieurs-axes-simultan-ment\">Sa capacité à visualiser plusieurs axes simultanément</h3>\n<p>Mais la plupart des utilisations de ce diagramme que l&#39;on rencontre dans la nature exploitent des axes de catégories qui n&#39;ont aucun ordre intrinsèque. </p>\n<center>\n<img src=\"/files/spiderSmall0.png\" alt=\"\">\n</center>\n<p align=\"left\"></p>\nLe fait d&#39;être côte à côte pour deux axes est totalement arbitraire. Voici 4 versions du même jeu de données.\n<center>\n<img src=\"/files/spider0Small.jpg\" alt=\"\">\n</center>\n\n<h3 id=\"l-ambig-it-surface-distance\">L’ambigüité surface/ distance</h3>\n<p>La rose de <a href=\"http://en.wikipedia.org/wiki/Florence_Nightingale\">Florence Nightingale</a> montre l&#39;origine des décès des soldats lors de la guerre de Crimée de 1854. La surface rouge les blessures, bleue une maladie contagieuse et noire non classée. On comprend bien à la vue de ce diagramme que les ennemis les plus féroces sont le typhus et le choléra.</p>\n<center>\n<img src=\"/files/NightingaleSmall1.png\" alt=\"\">\n</center>\n\n\n<p>Ce n&#39;est pas évident au premier coup d&#39;&oelig;il mais il y a deux manières distinctes de lire le diagramme de Nigthtingale:</p>\n<ul>\n<li>la distance du périmètre externe de la tranche au centre</li>\n<li>la surface de la tranche (ou de la portion de tranche)</li>\n</ul>\n<p>Et ce n&#39;est pas la même chose ! Quand le rayon de la tranche est multiplié par 2, la surface de celle ci est multipliée par 4. La vaste majorité des cobayes à qui on demande de retrouver les valeurs des données à partir du diagramme de Nightingale, mesurent les rayons alors que ce sont les surfaces qui encodent les données.</p>\n<p>Y compris pour les représentations filaires pour lesquelles il semble clair que c&#39;est la distance au centre qui est la donnée, on ne peut s&#39;empêcher de voir la surface que forme l&#39;angle avec la ligne qui joint les points de mesure successifs. Surface de forme aussi arbitraire que l&#39;ordre choisi pour les axes!!!</p>\n<h3 id=\"la-comparaison-sur-plusieurs-axes\">La comparaison sur plusieurs axes</h3>\n<h4 id=\"un-diagramme-pour-tous\">Un diagramme pour  tous</h4>\n<p>A condition d&#39;utiliser une représentation filaire (pas comme celle de Nightingale), il est possible de mettre plusieurs entités sur un même diagramme et de les comparer. A un objectif ou entre elles. \nLa convention habituelle est que le centre est la note la plus faible, la périphérie la plus haute.</p>\n<center>\n<img src=\"/files/spider3_FOFTQKPYETMF1YERWZIS.png\" alt=\"\">\n</center>\n\n<h3 id=\"les-concurrent-les-plus-directs-du-diagramme-araign-e\">Les concurrent les plus directs du diagramme araignée</h3>\n<ul>\n<li>le <em>diagramme en points</em><center>\n<img src=\"/files/spider4_UPTUA4TATR3HCVXSSORJ.png\" alt=\"\">\n</center></li>\n<li>la <em>carte de score</em> ou la <em>punch card</em><center>\n<img src=\"/files/spider5_A8IMBUO8JDFA7QPEBNR9.png\" alt=\"\">\n</center> \n\n</li>\n</ul>\n<h4 id=\"un-diagramme-pour-chacun\">Un diagramme pour chacun</h4>\n<p>C&#39;est l&#39;utilisation faite par une célèbre marque de comparatifs de produits techniques. </p>\n<center>\n<img src=\"/files/compare.png\" alt=\"\">\n</center>\n\n\n<p>Le diagramme radar a des atouts certains dans cet usage. Le regard peut identifier et reconnaitre efficacement des <strong>profils</strong>. Les grands nez, les petites oreilles, ... Enfin l&#39;ensemble des caractéristiques désirables ou indésirables parmi un grand nombre de schémas.</p>\n<p>L&#39;appareil Sony fournit un bon exemple de l&#39;erreur de perception surface/distance. Sur la version radar l&#39;appareil est quasiment parfait. Le diagramme en points (dotplot) montre de manière plus objective ses caractéristiques. </p>\n"}}}
