{"path":"blog/TableauSoft","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"L'outil de visualisation Tableau Software","slug":"TableauSoft","contents":"<h1 id=\"tableau-software\">Tableau Software</h1>\n<p><a href=\"http://www.tableausoftware.com/fr-fr\">Tableau</a> démocratise vraiment la visualisation des données. Après une courte formation, un néophyte est capable de projeter ses données sur des modes de représentation suggérés par l&#39;outil, d&#39;explorer des variantes et de <strong>découvrir</strong> au détour d&#39;un essai une <strong>révélation éclatante</strong> encore insoupçonnée: des ordres de grandeur relatifs, une tendance persistante dans le temps, une relation entre des phénomènes, ...</p>\n<p>Les données de travail sont d&#39;abord désignées ou importées, puis en quelques glissé-déplacés, la visualisation pertinente est conçue et mise à disposition de tous.</p>\n<p>Prenons <strong>la baignoire qui fuit</strong>, c&#39;est le modèle de tous les systèmes qui entretiennent des files d&#39;attentes de demandes:</p>\n<ul>\n<li>une hot-line,</li>\n<li>un système de gestion d&#39;anomalies ou de demande d&#39;évolution,</li>\n<li>les devis en attente,</li>\n<li>...</li>\n</ul>\n<p>A chaque période, les grandeurs intéressantes sont:</p>\n<ul>\n<li>nombre de nouvelles demandes reçues (<strong>le robinet</strong>),</li>\n<li>nombre de demandes traitées (<strong>la fuite</strong>),</li>\n<li>l&#39;évolution du solde (<strong>le niveau de l&#39;eau</strong>).</li>\n</ul>\n<p>Il est fructueux de visualiser simultanement ces trois grandeurs. En quelques instants <a href=\"http://www.tableausoftware.com/fr-fr\">Tableau</a> permet cette représentation:</p>\n<iframe\n  style=\"border: 0px;\"\n  src=\"https://public.tableausoftware.com/views/Baignoire2/Tableau2?:embed=y&amp;:from_wg=true&:showVizHome=no\"\n  scrolling=\"no\"\n  width=\"680px\"\n  height=\"320px\">\n</iframe>\n\n<p>La courbe en noir est <strong>le niveau de l&#39;eau</strong>, les barres grises et rouges, les ajouts et réalisations de la période. </p>\n<p>Il est facile de distinguer A) Une croissance causée par des ajouts seuls, B) une décroissance provoquée par des seules réalisations et C) une période sans évolution du solde car les entrées compensent les sortie.</p>\n"}}}
