{"templateIndex":3,"sharedHashesByProp":{},"data":{"post":{"title":"Les feux tricolores restent sur la route !","slug":"stop-aux-feux-tricolores","contents":"<h2 id=\"stop-aux-feux-tricolores-\">Stop aux feux tricolores...</h2>\n<p>D&#39;innombrables échelles vert, orange, rouge peuplent les tableaux de bord de toutes origines ? \nLa symbolique des couleurs du feu de croisement profite de l&#39;universalité du code de la route: vert=ok, orange=alerte, rouge=problème. Tellement utilisé que l&#39;on n&#39;y pense même plus. \nUne minute, ... Est ce une bonne visualisation ? </p>\n<center>\n    <img src=\"/files/feutrs.png\" alt=\"\" title=\"Jdown logo\">\n</center>\n\n<h3 id=\"la-route\">La route</h3>\n<p>Revenons à l&#39;origine. Le premier feu de croisement (bicolore) est installé à <a href=\"http://fr.wikipedia.org/wiki/Feu_de_circulation\">Salt  Lake City en 1912</a>. Il fut progressivement enrichi d&#39;états supplémentaires: orange, clignotements, combinaisons, ... L&#39;objectif global restant d&#39;organiser le partage harmonieux d&#39;une ressource exclusive: <em>le carrefour</em>.</p>\n<ul>\n<li>vert     = <strong>passez, l&#39;autre voie est rouge</strong> </li>\n<li>rouge     = <strong>arrêtez vous, l&#39;autre voie est vert</strong></li>\n<li>orange     = <strong>attention, le feu va passer au rouge</strong></li>\n</ul>\n<h3 id=\"le-rail\">Le rail</h3>\n<p>Un autre exemple vénérable de partage d&#39;une section critique est le passage à niveau. Vu de loin il s&#39;agit du même problème que la route: l&#39;accès raisonné à cette petite portion d&#39;espace à cheval entre le bitume et les rails. \nSauf qu&#39;il y a une différence majeure (autre que la priorité du train qui impose le rouge à la route): La voiture peut passer sans danger 99,9% du temps, il serait donc stupide (et écologiquement irresponsable) d&#39;allumer un feu vert tout ce temps. Quand il existe, le signal lumineux (rouge clignotant) du passage à niveau se déclenche quelques instants avant le passage du train et ... s&#39;éteint après.\nC&#39;est vrai après tout, le vert n&#39;est pas nécessaire, on pourrait aussi au carrefour routier n&#39;utiliser que le rouge: <strong>le feu mono colore</strong>... <strong>Rouge = stop</strong>, <strong>Rien = passez</strong>. Le vert n&#39;apporte aucune information supplémentaire.\nA y réfléchir de plus près, le feu vert offre un discret bénéfice qui, à lui seul, rend souhaitable de le conserver à nos carrefours: la redondance de sécurité - en l&#39;absence de feu vert une ampoule rouge <strong>en panne</strong> serait catastrophique...</p>\n<h3 id=\"le-tableau-de-bord\">Le tableau de bord</h3>\n<p>Quel est donc le rapport entre les indicateurs de suivi, de pilotage d&#39;une activité et ... un feu tricolore? Pas grand chose !!\nCe qui ne va pas dans le feu tricolore pour les tableaux de bord, c&#39;est <strong>le vert</strong>. Il est:</p>\n<ul>\n<li>redondant: l&#39;information utile est la présence d&#39;alertes ou de problèmes.  <strong>Je vois bien que ce n&#39;est pas rouge !</strong></li>\n<li>nuisible: de nombreux indicateurs sont simultanément présents sur le tableau de bord. <strong>Le rouge est dilué dans le vert !</strong> </li>\n</ul>\n<center>\n    <img src=\"/files/feuverttrs.jpg\" alt=\"\">\n</center>\n\n<p>Sur un tableau de bord <strong>le vert le plus efficace c&#39;est ... le blanc</strong>...</p>\n"}},"path":"blog/stop-aux-feux-tricolores"}
