{"path":"blog/qui","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"qui","slug":"qui","contents":"<h1 id=\"qui-est-perceptible-fr-\">Qui est perceptible.fr ?</h1>\n<p><strong>perceptible.fr</strong> a été crée par Alain Roan, Ingénieur Supelec. Il a participé depuis 20 ans, en première ligne, à l&#39;élaboration et la diffusion des méthodes et des technologies visant à l&#39;amélioration des pratiques et des façons de faire de l&#39;ingénierie des systèmes/logiciels complexes et critiques pour la plupart des domaines industriels en Europe et aux États-Unis. Il a occupé des responsabilités qui couvrent une bonne partie de la mosaïque d&#39;une entreprise: R&amp;D, développement/production, services/conseil, marketing, ventes, support, direction générale. </p>\n<p><strong>perceptible.fr</strong> est à la convergence de différentes forces :</p>\n<ul>\n<li>la reconnaissance que le maillon faible de la pyramide désormais très haute d&#39;outils et de méthodes, reste (comme pour toujours) la <strong>décision humaine</strong></li>\n<li>le constat que partout y compris dans les plus grandes entreprises équipées des logiciels de gestion les plus sophistiqué, la plupart des salariés utilisent des tableurs pour mémoriser, calculer et présenter des données qui leur servent à <strong>comprendre</strong>, <strong>mesurer</strong>, <strong>expliquer</strong> et <strong>décider</strong></li>\n<li>l&#39;avènement de technologies de rupture qui bouleversent et court-circuitent les vieilles façons de penser et de faire. <strong>État des neurosciences</strong>, <strong>Html 5</strong>, <strong>open source</strong>... </li>\n<li>et la robustesse des <strong>méthodes agiles</strong> qui à <strong>petits pas</strong> font de grandes enjambées</li>\n</ul>\n<p><strong>perceptible.fr</strong> exploite les meilleures technologies disponibles pour rendre le contrôle à la décision humaine: <strong>des données visuelles qui &quot;parlent&quot;</strong> à leurs destinataires.</p>\n"}}}
