{"path":"blog/post/tableaucourbes","templateID":2,"sharedPropsHashes":{},"localProps":{"post":{"title":"Tableau de courbes","slug":"tableaucourbes","contents":"<h2 id=\"le-tableau-de-courbes-plut-t-que-le-tableau-de-chiffres\">Le Tableau de courbes plutôt que le Tableau de chiffres</h2>\n<h3 id=\"la-table-de-valeurs\">La Table de Valeurs</h3>\n<p>La version la plus élémentaire de la présentation de donnés est le  catalogue de valeurs. L&#39;ambition est de fournir de manière rapide la réponse aux questions les plus élémentaires: <em>Quel est le montant des ventes en France en Avril ?</em>\nLa table est organisée pour fournir avec toutes les décimales, au centime près, toutes les réponses selon un format très touffu qui décourage la moindre tentative de dégager visuellement des informations de tendance et de comparaison. </p>\n<center>\n   <img class=\"img-responsive\" src=\"http://perceptible.fr/files/Courbes2.png\">\n</center>\nIl s&#39;agit ici plus d&#39;un reporting à plat qu&#39;un outil d&#39;aide à la décision. Elle ne devrait plus être présentée à des humains au 21 siècle. \n\n### Le Tableau digeste\nUne version plus humaine consiste à présenter les nombres sous une forme plus digeste privilégiant l&#39;ordre de grandeur à la précision. Deux chiffres significatifs sont largement suffisants pour discriminer de 1 à 100. L&#39;utilisation d&#39;unités adaptées permet de limiter le nombre de zéros et renforce l&#39;appréciation visuelle des différences. Il est même possible de d’omettre les valeurs les plus faibles.\n<center>\n   <img class=\"img-responsive\" src=\"http://perceptible.fr/files/Courbes1.png\">\n</center>\n\n<h3 id=\"le-tableau-de-courbes\">Le Tableau de Courbes</h3>\n<p>Mais si l&#39;objectif est de comprendre, piloter, réagir, maximiser les ventes, alors il est souhaitable de passer à d&#39;autres types de représentations. L’œil est très efficace pour reconnaître des schémas, surveiller les tendances, prolonger visuellement une trajectoire, détecter les points aberrants,... Utilisons le au maximum en prenant le point de vue extrême opposé aux versions précédentes, un tableau sans <strong>aucun</strong> chiffre.</p>\n<center>\n   <img class=\"img-responsive\" src=\"http://perceptible.fr/files/Courbes0.png\">\n </center>\n\n<p>Les courbes visualisent l&#39;historique des grandeurs au cours de l&#39;année. La zone grisée en arrière plan indique le cumulé à date. La France est la première source de revenu, suivi de l&#39;Europe en baisse et des US en croissance. Les ordres de grandeur deviennent visibles et l&#39;efficacité de la publicité sur le chiffre d&#39;affaires apparaît en pleine lumière. Il n&#39;est même plus utile de connaître l&#39;unité de l&#39;axe vertical k€, M€ ou $, aucune importance.\nSoudain le lecteur se met à poser des question plus intelligentes: <em>Pourquoi la publicité sur la zone Asie est-elle si peu efficace ? Que se passe t-il en zone Europe ? L’accroissement relatif de publicité est il une réaction aux mauvais résultats ou l&#39;effet mécanique de la baisse de CA ?</em></p>\n"}}}