{"path":"blog/bigdata","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"Tableau de bord des SMS","slug":"bigdata","contents":"<h1 id=\"un-cas-de-big-data-domestique-h2-\">Un cas de big data domestique</h2></h1>\n<h3 id=\"l-indicateur-n-est-pas-l-objectif\">L&#39;indicateur n&#39;est pas l&#39;objectif</h3>\n<p>J&#39;ai croisé très récemment un cas concret où un indicateur que l&#39;on croyait être l&#39;objectif disparait et qu&#39;il faille en reconstruire d&#39;autres mais que l&#39;abondance des données de base rende la tâche ... <em>challenging</em>: il s&#39;agit de <strong>la facture de téléphone d&#39;adolescents</strong>. </p>\n<p>Il y a encore pas longtemps, l&#39;indicateur <em>de pilotage</em> utilisé par les parents était: le cout mensuel en €. Le montant du forfait de base ayant été âprement négocié et ne changeant pas d&#39;un mois sur l&#39;autre, c&#39;était l&#39;éventuel <strong>dépassement</strong> en € qui servait d&#39;indicateur. Ou la fréquence d&#39;achat de cartes prépayées pour les plus prudents.</p>\n<p>L&#39;arrivée des forfaits Free à 2€ incluant 2 heures de voix et <strong>sms illimités</strong> vient perturber les habitudes. L&#39;indicateur mensuel de cout des dépassements reste valable pour la voix. Pour les sms gratuits, il faut dé scotcher de l&#39;ancien indicateur, le véritable objectif <em>paternaliste</em> qui pourrait être quelque chose comme: &quot;Encourager l&#39;usage raisonné du portable&quot;. </p>\n<p>Les factures mensuelles contiennent la liste chronologique des sms, le numéro destinataire (sans les quatre derniers chiffres) et l&#39;heure d&#39;émission. Seul problème, trois mois de factures représentent plus de 5500 lignes sur 98 pages. Chaque ligne est parfaitement lisible mais le schéma global est complètement <strong>invisible</strong>. Un cas de Big Data domestique en quelque sorte.</p>\n<center>\n<img src=\"/files/sms.png\" alt=\"\"/>\n</center>\n\n<h3 id=\"convertir-les-factures-pdf-en-excel\">Convertir les factures pdf en excel</h3>\n<p>De nombreux services web gratuits offrent la conversion de pdf en xls. La conversion est parfois déficiente et nécessite des ajustements manuels de mise en page, mais il suffit de quelques minutes pour avoir toutes les lignes dans excel. En plaçant des noms de colonnes appropriés, un tri sur la date et l&#39;heure permet de regrouper les lignes utiles et d&#39;éliminer les hauts et pieds de page.</p>\n<h3 id=\"quels-indicateurs-\">Quels indicateurs ?</h3>\n<p>Les indicateurs se déduisent des questions que tout parent se posent, la plus globale est : «L&#39;utilisation journalière est elle raisonnable ?» </p>\n<p>D&#39;abord en quantité. Le nombre est indiqué en haut de la facture (plusieurs milliers pour un mois) reste une grandeur vaguement abstraite que l&#39;on divise mentalement par 30 jours pour se faire une idée concrète. Mais il faudrait connaitre les valeurs par jour de la semaine. La tolérance en semaine et en weekend n&#39;est pas la même. </p>\n<p>Le deuxième indicateur à bâtir doit répondre à la partie qualitative de la question: </p>\n<blockquote>\n<blockquote>\n<p>«Les moments d&#39;utilisation sont ils compatibles avec la scolarité ?» </p>\n</blockquote>\n</blockquote>\n<h3 id=\"quelle-visualisation-\">Quelle visualisation ?</h3>\n<p>Pour la quantité d&#39;utilisation journalière, un diagramme en barres chronologique sera parfait. Une couleur pour les jours de la semaine, une autre pour les weekends. L&#39;axe des Y peut être en nombre émis ou en équivalent durée de composition. Prenons par exemple 15 secondes par sms (les ados sont rapides mais il faut aussi tenir compte du temps de lecture des sms reçus qui sont invisibles sur la facture mais forcement présents dans un ordre de grandeur similaire). On obtient tout de même un pic à 60 minutes pour la journée du 23 mars. </p>\n<center>\n <iframe\n  style=\"border: 0px;\" \n  src = \"/sandbox/sms.html\"\n  scrolling=\"no\"\n  seamless\n  frameborder=\"0\"\n  width=\"704px\"\n  height=\"390px\">\n</iframe>\n</center>\n\n<p>Pour les instants d&#39;émission, l&#39;idée la plus simple est de visualiser chaque sms par un point sur un axe vertical de 24h. Une subtilité toutefois, pour éviter que les sms après minuit passent au jour d&#39;après et brouillent la lecture des soirées tardives, il faut créer une <strong>ligne de changement de jour</strong>, j&#39;ai choisi ici 03:00. On constate de nombreux envois au delà de la barre des 22:30 et même une émission à 5:30 du matin le dimanche 31 mars.</p>\n"}}}
