{"path":"blog/carte","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"Présenter à chacun ce qui est important pour lui","slug":"carte","contents":"<h1 id=\"le-making-of-des-chantiers\">Le &#39;making of&#39; des chantiers</h1>\n<h3 id=\"historique\">Historique</h3>\n<p>Mon implication dans les chantiers de la ville de Toulouse à commencée lors du <a href=\"http://perceptible.fr/blog/chantiers\">Hackaton</a>. Elle s&#39;est continuée naturellement dans le concours <a href=\"http://data.toulouse-metropole.fr\">Défi Numérique</a>. L&#39;équipe a produit une web-app et une app Android: <a href=\"http://infotravaux.fr\">Info&#39;Travaux</a> qui inclut les idées de visualisation décrites ici et y ajoute des fonctionnalités précieuses comme l&#39;abonnement aux nouveaux chantiers dans les zones d&#39;intérêt et surtout les itinéraires en voiture permettant d&#39;éviter les chantiers. <em>Le projet <a href=\"http://infotravaux.fr\">Info&#39;Travaux</a>  a gagné le prix du &quot;Services aux citoyens&quot;.</em></p>\n<center>\n\n<img src=\"/files/chantiers.gif\" alt=\"\">\n</center>\n\n<p>Google Maps et autres Waze peuvent parfois constater un ralentissement dans une rue, mais ni l&#39;un ni l&#39;autre ne sait pourquoi et pour combien de temps, <a href=\"http://infotravaux.fr\">Info&#39;Travaux</a> lui oui. </p>\n<h3 id=\"a-la-recherche-de-la-visualisation-efficace\">A la recherche de la visualisation efficace</h3>\n<p>Quand on essaye de placer sur une carte des centaines de punaises et parfois des dizaines sur 1 cm2, on se rend compte qu&#39;il y a sûrement mieux à faire que de superposer des icônes/marqueurs identiques qui seront illisibles et très difficiles à sélectionner individuellement. \nIl y a maintenant plus de 30 ans qu&#39;<a href=\"http://en.wikipedia.org/wiki/Edward_Tufte\">Edward Tufte</a> a proposé un critère objectif de la bonne utilisation de l&#39;encre: le <strong>data/ink ratio</strong>. En français et sur écran: le rapport <em>nb données/nb de pixels</em>. Chaque trait, couleur, surface utilisé doit être questionnée à propos de son apport à la présentation des données en regard de la place qu&#39;elle accapare au détriment des autres sur le papier, l&#39;écran et ultimement sur la rétine et dans le cerveau de l&#39;utilisateur. C&#39;est un tamis très efficace pour apprendre à éliminer le bruit visuel et se concentrer sur l&#39;essentiel.\nEncore mieux, s&#39;il est possible de pondérer chaque donnée par la <em>valeur</em> qu&#39;elle a pour l&#39;utilisateur: <em>(valeur X donnée) / pixels</em>, on peut créer des interfaces et des visualisations optimales pour les familles d&#39;utilisateurs qui partagent les mêmes objectifs.\nLa mission que l&#39;on assigne au marqueur est alors d&#39;attirer l&#39;attention du lecteur d&#39;autant plus que le chantier est important pour lui. Un premier essai inspiré de <a href=\"http://perceptible.fr/blog/chantiers\">visualisation</a> utilisait la durée restante. Un cercle de diamètre d&#39;autant plus gros que le chantier allait encore longtemps perturber la circulation. Une fois réalisé et expérimenté plusieurs défauts se font jour et notamment deux: </p>\n<ol>\n<li>la taille des cercles devient très grande à cause de la forte dynamique des données (de 1j à 3 ans) jusqu&#39;à devenir inutilisable </li>\n<li>le critère durée est trop écrasant, une gène énorme courte est totalement masquée par des gènes très légères ou nulles pour certain modes de transport pour peu qu&#39;elles soient longues \nCette deuxième version va plus loin en faisant émerger des données le niveau de gène par mode de transport grâce à une pondération des différents impacts sur la circulation:<center>\n<img src=\"/files/NiveauxGène.png\" alt=\"\">\n</center>\n\n</li>\n</ol>\n<p>On peut combiner les deux dimensions :</p>\n<ul>\n<li>le niveau de gène sur une échelle de 0 à 5</li>\n<li>la durée restante mais bornée à 3 mois pour éviter le défaut de la forte dynamique</li>\n</ul>\n<p>en un seul indicateur, selon les principes suivants:</p>\n<ul>\n<li>la taille du disque est d&#39;autant plus grande que le chantier est gênant, avec une légende de couleur en redondance</li>\n<li>l&#39;épaisseur de la couronne représente la durée restante. Disque plein si encore plus de 3 mois et un simple cercle pour la semaine. \n<center>\n<img src=\"/files/legend.png\" alt=\"\">\n</center>\nAinsi combinés, le nombre de pixels occupés sur l&#39;écran est d&#39;autant plus grand que le chantier mérite l&#39;attention du lecteur. Quelques bonnes propriétés de cet indicateur:</li>\n<li>les chantiers proches se superposent pour former une grande tâche de couleur qui indique tout naturellement et sans plus de détails un quartier fortement perturbé et pour un temps certain</li>\n<li>en zoom large les grosses tâches masquent les petites mais se séparent quand l&#39;agrandissement est suffisant</li>\n<li>le caractère quasi aléatoire de la position, taille et épaisseur fait que les marqueurs se distinguent et se sélectionnent facilement</li>\n</ul>\n<h3 id=\"mode-d-emploi\">Mode d&#39;emploi</h3>\n<p>Chaque marqueur est un chantier. </p>\n<ul>\n<li><strong>Détails</strong>: <strong>Clic</strong> permet de faire apparaître une bulle d&#39;information à propos du chantier. <strong>Maj clic</strong> permet d&#39;en ouvrir plusieurs à la suite.</li>\n<li><strong>Navigation spatiale</strong>: le curseur en forme de main permet de faire glisser la carte par <strong>appuyer-glisser</strong>. <strong>Clic-clic</strong> fait un zoom avant, <strong>maj clic-clic</strong> un zoom arrière. Tracer un rectangle avec <strong>maj-appuyer-déplacer-relâcher</strong> zoom sur cette zone. Et bien sûr les icônes <strong>+</strong> et <strong>-</strong> en haut à gauche permettent le zoom avant/arrière</li>\n<li><strong>Filtre</strong>: les icônes voiture, piéton, vélo permettent de ne considérer que les chantiers qui impactent un mode de transport en particulier. Le i rassemble tous les chantiers y compris ceux sans influence sur la circulation</li>\n<li><p><strong>Voyage dans le temps</strong>: la glissière en bas de la carte permet de faire apparaître la situation à une date antérieure ou de se projeter dans le futur pour voir ce que seront les chantiers dans 3 mois. </p>\n<center>\n   <a href=\"/sandbox/chantiersTlse/chantiers.html target=&quot;_blank&quot;\">Ouvrir dans une fenêtre séparée</a>\n<em>A lire dans Chrome, Firefox ou Safari</em> \n\n<iframe\nstyle=\"border: 0px;\"\nsrc=\"/sandbox/chantiersTlse/chantiers.html\"\nscrolling=\"no\"\nwidth=\"800px\"\nheight=\"600px\">\n</iframe>\n</center>\n\n</li>\n</ul>\n<h3 id=\"les-donn-es-ouvertes\">Les Données Ouvertes</h3>\n<p>C&#39;est à l&#39;initiative de la Communauté Urbaine de Toulouse Métropole que les données concernant les chantiers sont rassemblées à l&#39;intérieur d&#39;une application nommée Orion. Chaque jour une partie des données gérées sont exportées vers la zone <a href=\"http://data.toulouse-metropole.fr/\">Open Data</a>  où elles deviennent accessibles à tout un chacun qui peut la télécharger en divers formats.</p>\n<h4 id=\"am-liorer-les-donn-es-et-leur-mise-jour\">Améliorer les données et leur mise à jour</h4>\n<p>La mise à disposition des données est un bénéfice incontestable. Et on en veut immédiatement plus. Au jour d&#39;écriture de ce billet (oct 2014), on aimerait bien <strong>quelques suppléments</strong>:</p>\n<ul>\n<li><strong>Un prévisionnel serait précieux</strong>: les chantiers sont publiés le jour de leur démarrage prévu. Dommage pour les chantiers qui durent une journée! Disposer d&#39;un prévisionnel pour les chantiers, même s&#39;il est amené à changer, pourrait être très précieux. Est ce possible ?</li>\n<li><strong>Quelques anomalies</strong>: certains jours le fichier n&#39;est pas disponible au téléchargement . Ou identique à celui de la veille. Ou est un fichier valide mais les données qu&#39;il contient sont incomplètes (des chantiers publiés la veille ne sont plus là mais sont à nouveau présent dans le fichier du lendemain). L&#39;exploitation des données ouvertes doit trouver des solutions pour tolérer ces aléas.</li>\n<li><strong>Pas de mise à jour en cours de route</strong>: certainement que des modifications ont lieu après la publication des données (chantier annulé ou terminé avant la date prévue, ...). On ne constate pourtant aucune mise à jour dans l&#39;open data. Les paramètres d&#39;un chantier publié restent identiques d&#39;un jour à l&#39;autre jusqu&#39;à ce que le chantier disparaisse de la liste. Pourquoi ?</li>\n<li><strong>Pourraient être plus précises</strong>: l&#39;impact du chantier est pour le moment très grossier: un point GPS, un nom de rue et parfois une fourchette de numéros dans la rue. S&#39;il était possible de récupérer les plans d&#39;emprise alors les trajets d&#39;évitement serait plus précis y compris pour le piéton et la personne à mobilité réduite. </li>\n</ul>\n<h4 id=\"les-donn-es-cach-es-dans-les-donn-es\">Les données cachées dans les données</h4>\n<p>Comme très souvent, les données sont instructives pas seulement par leur valeur et leur évolution mais aussi par leur présence (les dates de mises à jour) ou à leur disparition soudaine. Et les chantiers n&#39;échappent pas à la règle. </p>\n<p>Certains sont très sages: le chantier est répété à l&#39;identique tous les jours entre les dates de début/fin prévues initialement.</p>\n<p>Tandis que d&#39;autres:</p>\n<ul>\n<li>apparaissent plus tard que la date de début déclarée</li>\n<li>disparaissent plus tôt que la date de fin définie</li>\n</ul>\n<p>Probablement que les données exportées représentent en fait le <strong>permis de mener un chantier</strong> qui encadre le déroulement pour éviter de mélanger dans une même tranchée et au même moment des interventions sur l&#39;eau, le gaz et l&#39;électricité... Il serait alors logique qu&#39;aucune mise à jour rétroactive ne soit effectuée. Mais le citoyen préfèrerait certainement des informations plus proches de la réalité de la rue. Sont elles disponibles ?</p>\n"}}}
