{"templateIndex":3,"sharedHashesByProp":{},"data":{"post":{"title":"La single Page App","slug":"spa","contents":"<h1 id=\"single-page-app\">Single Page App</h1>\n<p>Les applications web proposées par <a href=\"http://perceptible.fr\">perceptible.fr</a> dans certaines de ses réalisations sont des <strong>Single Page Apps</strong>. </p>\n<blockquote>\n<p><strong>A moins qu&#39;il ne soit nécessaire d&#39;avoir des traitement « en arrière plan » le serveur n&#39;est pas toujours indispensable.</strong> </p>\n</blockquote>\n<blockquote>\n<p><strong>Les données restent confidentielles même s&#39;il n&#39;y a pas de login/ mot de passe.</strong> </p>\n</blockquote>\n<h2 id=\"architecture\">Architecture</h2>\n<p>Une Single Page Application (SPA, application web monopage en français) est une application accessible via une simple page web qui « contient tout ». Son intérêt est d&#39;éviter le chargement d&#39;une nouvelle page à chaque action demandée, et de fluidifier ainsi l&#39;expérience utilisateur. L’ensemble des éléments de l&#39;application est chargé (html, images, css, javascript et données) en une fois (ou plus exactement à la demande en fonction des actions de l&#39;utilisateur).</p>\n<blockquote>\n<p><strong>C’est un peu comme si le navigateur web devenait un ordinateur qui exécutait localement un programme téléchargé sur le web.</strong></p>\n</blockquote>\n<p>Cette philosophie diffère radicalement de l’application web client/serveur « classique » composée d’aller-retours continuels entre le « client ignorant des données globales et de ce qu&#39;elles signifient » et le serveur distant tout puissant. </p>\n<h2 id=\"fonctionnement\">Fonctionnement</h2>\n<p>La SPA est accessible via une adresse URL dans un navigateur: un clic sur un marque page ou sur un raccourci sur le bureau ou l’écran d’accueil.</p>\n<h3 id=\"importation-des-donn-es\">Importation des données</h3>\n<p>La SPA ne contient aucune donnée en propre et ne peut y accéder elle même. Les données sont contenues dans un fichier Excel qui est:</p>\n<ul>\n<li>placé à un endroit fixe. L’utilisateur délègue ses droits en lecture.</li>\n<li>désigné en cours d’utilisation de deux manières:<ul>\n<li>un bouton « lire le fichier » ouvre l’explorateur de fichiers et permet de désigner le classeur Excel (local ou distant)  </li>\n<li>un glisser/déposer du fichier dans la fenêtre (sur ordinateur  uniquement)</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"comportement-responsive-\">Comportement « responsive »</h3>\n<p>La page adapte dynamiquement son contenu à la taille du dispositif: la fenêtre sur le desktop, l’orientation sur la tablette ou le téléphone. Il ne s’agit pas seulement d’une mise à l’échelle mais aussi de ré-organisation « intelligente » de l’affichage.</p>\n<h3 id=\"impression-et-exportation\">Impression et exportation</h3>\n<p>La SPA est capable d’exporter son affichage sous plusieurs formats en plus du simple « imprimer » du navigateur. \nSont techniquement disponibles:</p>\n<ul>\n<li><strong>pdf</strong>: impression papier sur plusieurs pages, archivage et diffusion</li>\n<li><strong>png</strong>: image de taille ajustable pour réutilisation dans des rapports par exemple Word ou PowerPoint</li>\n<li><strong>svg</strong>: dessin vectoriel capable d’être affiché à toute résolution sans perte de netteté</li>\n<li><strong>xlsx</strong>: sous-ensemble des données filtrées et pouvant aussi contenir les diagrammes </li>\n</ul>\n<h3 id=\"m-morisation-des-pr-f-rences-de-la-page\">Mémorisation des préférences de la page</h3>\n<p>La SPA est capable de mémoriser les préférences d’affichage dans le navigateur de telle sorte que le rafraichissement de la page ne perde pas les choix récents: couleur, position des blocs, filtres, … Cette mémorisation s’effectue localement au navigateur et est persistante d’une session à l’autre pour chacun des utilisateurs.</p>\n<h3 id=\"h-bergement-de-la-spa\">Hébergement de la SPA</h3>\n<p>La SPA est constitué de quelques fichiers qu’il convient de rendre accessible à l’utilisateur soit sur un réseau privé ou public à condition de sécuriser les données.</p>\n<h2 id=\"b-n-fices\">Bénéfices</h2>\n<p>Cette architecture de SPA très simple et minimale comporte de multiples avantages: </p>\n<blockquote>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left\"></th>\n<th style=\"text-align:left\"></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left\"><strong>- Sécurité</strong></td>\n<td style=\"text-align:left\">Préserve la confidentialité des données</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><strong>- Robustesse</strong></td>\n<td style=\"text-align:left\">Capable de résister aux pannes</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><strong>- Sobriété</strong></td>\n<td style=\"text-align:left\">Économe en moyens et ressources</td>\n</tr>\n<tr>\n<td style=\"text-align:left\"><strong>- Performance</strong></td>\n<td style=\"text-align:left\">Très confortable à utiliser</td>\n</tr>\n</tbody>\n</table>\n</blockquote>\n<h3 id=\"s-curit-\">Sécurité</h3>\n<ol>\n<li><strong>La SPA ne lit que les données que l’utilisateur désigne</strong>: Elle ne peut avoir accès qu’aux données déjà désignées et accessibles à l’utilisateur. </li>\n<li><strong>La SPA ne peut pas modifier les données</strong>: C’est la conséquence d’une sécurité globale des navigateurs, une page web ne peut pas <strong>écrire</strong> dans un fichier local. Elle ne peut que proposer le téléchargement d’un nouveau fichier.</li>\n<li><strong>La SPA n’ouvre pas de brèche de confidentialité</strong>: A l’ouverture de la SPA le navigateur charge l’intégralité de l&#39;application strictement authentifiée dans le navigateur. C’est elle qui va lire, décoder et afficher les données sur l’écran. <strong>Les données ne sortent pas de la machine qui exécute la SPA</strong>. </li>\n</ol>\n<h3 id=\"robustesse\">Robustesse</h3>\n<ol>\n<li><strong>Aucun risque de perte de données</strong>: la SPA ne peut pas altérer les données source. Seule l’interruption brutale du navigateur ou de la machine utilisée peut provoquer au pire la perte de la sélection courante.</li>\n<li><strong>Disponibilité totale</strong>: la SPA est disponible autant que l’infrastructure d’accès aux données l’est. </li>\n<li><strong>Résistant à la coupure internet</strong>: La SPA a la possibilité de s’exécuter en local (ordinateur ou réseau entreprise) sans nécessiter d’accès internet. </li>\n</ol>\n<h3 id=\"sobri-t-\">Sobriété</h3>\n<p>La SPA est particulièrement économe en moyens et ressources d’exploitation:</p>\n<ol>\n<li><strong>Pas besoin de serveur</strong>: l’intégralité des calculs s’effectuent sur les machines des utilisateurs. Les données restent à l’endroit où elle se trouvent. La SPA produit des éléments de rapports et d’analyse qui sont gérés par l’utilisateur comme des fichiers. </li>\n<li><strong>Ne nécessite aucune administration</strong>: inutile de gérer des comptes ou des autorisations d’accès, pas besoin de sauvegarde particulière, inutile de corriger l’intégrité des données manuellement après un crash, …</li>\n<li><strong>Une seule application pour tous les supports</strong>: la même SPA fonctionne sur les différents supports: ordinateur, tablette, téléphone, en adaptant dynamiquement son affichage aux tailles disponibles.</li>\n</ol>\n<h3 id=\"performance\">Performance</h3>\n<ol>\n<li><strong>Fluidité inégalée</strong>: une fois les données nécessaires chargées dans le navigateur, il est possible d&#39;utiliser des techniques de filtrage <strong>à la souris</strong>. </li>\n<li><strong>Chargement à la volée</strong>: le chargement des données nécessaires s&#39;effectue au fur et à mesure des fonctionnalités et des filtrages activés par l&#39;utilisateur. </li>\n<li><strong>Optimisation statique</strong>:  peu importe la complexité fonctionnelle de l&#39;application, elle sera vue comme une collection de simples pages html.</li>\n</ol>\n<h2 id=\"un-exemple-de-spa\">Un exemple de SPA</h2>\n<p><a href=\"https://alainro.github.io/cashflow/\">Simulateur de trésorerie</a></p>\n<h2 id=\"la-progressive-web-app\">La Progressive Web App</h2>\n<p>La Progressive Web App (PWA) permet d&#39;aller encore plus loin sur les supports mobiles (tablettes et téléphone). L&#39;application devient quasiment indiscernable d&#39;une application native (plus de barre de navigation, icône de démarrage sur l&#39;écran d&#39;accueil, splash screen, fonctionnelle hors connexion, ...)\n<a href=\"https://fr.wikipedia.org/wiki/Progressive_web_app\">wikipedia</a></p>\n"}},"path":"blog/spa"}
