{"templateIndex":3,"sharedHashesByProp":{},"data":{"post":{"title":"Excel","slug":"excel","contents":"<h1 id=\"excel\">Excel</h1>\n<p>Excel est le couteau suisse de la vie de bureau. Le néophyte et l&#39;expert l&#39;utilisent quand rien d&#39;autre de plus approprié n&#39;est disponible, pour eux mêmes et quelques heures ou ... pour cent personnes et quelques années.</p>\n<p>Conteneur polyvalent d&#39;information structurée:</p>\n<ul>\n<li>base de donnée</li>\n<li>base de connaissance</li>\n<li>formulaires</li>\n<li>...</li>\n</ul>\n<p>Ébauche opérationnelle d&#39;outil métier:</p>\n<ul>\n<li>calculatrice spécialisée (devis, stocks, commissions, ...)</li>\n<li>générateur de rapport et de graphiques </li>\n<li>reporting</li>\n<li>todo list et suivi de projet</li>\n<li>planification</li>\n<li>budget et comptabilité</li>\n<li>...</li>\n</ul>\n<p>C&#39;est certainement l&#39;outil de génie logiciel le plus utilisé au monde... Et le pire cauchemar du management et de la Direction Informatique qui craignent que de précieuses connaissances et données ignorées restent enfouies dans la prolifération anarchique de fichiers non sérieusement gérés.</p>\n<p>Pourtant convenablement utilisé, seul ou en association avec d&#39;autres technologies, Excel supporte de façon tout à fait satisfaisante, la visualisation d&#39;indicateurs et de tableaux de bord:</p>\n<ul>\n<li>extraction de données (import fichier, requêtes, ...)</li>\n<li>calculs, filtres, consolidation, ...</li>\n<li>présentation graphique et tabulaire</li>\n<li>mise en page, impression</li>\n</ul>\n<p>C&#39;est dans beaucoup de cas une solution simple, robuste et peu couteuse qu&#39;il faut considérer. On est souvent agréablement surpris de ce qu&#39;il est possible d&#39;obtenir d&#39;une feuille Excel bien utilisée.</p>\n<center>\n<strong>Voici un exemple de tableau de bord Excel interactif d&#39;un portefeuille de projets</strong>\n</center>\n\n<center>\n<img src=\"/files/excelsmall.gif\" alt=\"\">\n</center>\n\n<p>Parmi les gros intérêts de l&#39;approche: sa flexibilité. L&#39;utilisateur garde le contrôle de l&#39;apparence finale: mise en page, couleurs, tailles, changement de nom de libellés, ... \nPour les organisations déjà équipées en outils d&#39;aide à la décision, le tableur Excel ne sera qu&#39;un produit intermédiaire une maquette et un cahier des charges de développements dédiés.</p>\n"}},"path":"blog/excel"}
