{"path":"blog/indicateurs-projets","templateID":3,"sharedPropsHashes":{},"localProps":{"post":{"title":"Indicateurs Projets","slug":"indicateurs-projets","contents":"<h1 id=\"indicateurs-d-avancement-de-projets\">Indicateurs d&#39;avancement de projets</h1>\n<p>Tout projet devrait être suivi simultanément sur 3 dimensions:</p>\n<ul>\n<li>le temps </li>\n<li>le coût </li>\n<li>l&#39;avancement </ul>\nArrêtons nous sur la troisième, et examinons les indicateurs visuels pouvant être utiles.</li>\n</ul>\n<h3 id=\"morceler-et-compter\">Morceler et Compter</h3>\n<p>Le plus robuste consiste à <strong>morceler</strong> l&#39;objectif global d&#39;un projet en éléments concrets observables (le nombre de parpaings posés sur le mur) indépendamment des tâches, du coût, des efforts et du temps passé.</p>\n<p>Il est alors possible de construire des indicateurs très efficaces qui vont simplement <strong>compter</strong>.</p>\n<p>Quand le projet consiste à appliquer une succession d&#39;étapes à des objets que l&#39;on peut énumérer (stories Scrum, todo list, ..) il suffit de compter le nombre d&#39;objets présents dans chaque état de son cycle de vie. Cycle qui peut être plus ou moins détaillé:</p>\n<ul>\n<li>binaire   -&gt; A faire, Fini</li>\n<li>classique -&gt; A faire, En cours, Fini</li>\n<li>complexe  -&gt; Créé, Accepté, Estimé, Planifié, En cours, Fini, Livré</li>\n</ul>\n<p>Et de représenter ces comptages visuellement: </p>\n<center>\n<img src=\"/files/Avancement.png\" alt=\"\">\n</center>\n\n<p>Même principe s&#39;il s&#39;agit de propriétés que l&#39;on peut énumérer, par exemple sur un projet de rédaction d&#39;un document de spécification: </p>\n<center>\n<img src=\"/files/syst.png\" alt=\"\">\n</center>\n\n<p>Sont ajoutés ici: </p>\n<ul>\n<li>l&#39;évolution du périmètre en cours de projet qui évidemment change la valeur de l&#39;avancement</li>\n<li>l&#39;historique de la progression de l&#39;avancement qui apporte une information dynamique: est ce que ça avance ? depuis combien de temps est ce bloqué ? Et prévient même si on revient en arrière.</li>\n</ul>\n<h3 id=\"burndown-chart\">Burndown Chart</h3>\n<p>Le burndown chart très utilisé par les méthodes agiles est un outil <strong>très pertinent</strong> pour prédire la date de terminaison d&#39;une tâche ou du projet. Ou pour estimer le contenu qui sera disponible à une date future. Il suffit de prolonger visuellement le rythme actuel pour évaluer la date où les courbes se croisent.</p>\n<p>La version la plus complète est le Burnup Chart (la version ascendante) avec la visualisation des évolutions de périmètre.</p>\n<center>\n<img src=\"/files/burn.png\" alt=\"\">\n</center>\n\n<h3 id=\"groupe-de-projets\">Groupe de projets</h3>\n<p>Passons au niveau du groupe de projets partageant le même processus, les mêmes activités. Par exemple: </p>\n<ul>\n<li>spécification, codage, tests unitaires, tests fonctionnel ... dans un domaine logiciel</li>\n<li>terrassement, maçonnerie, plomberie, électricité, peinture, ... dans le bâtiment</li>\n</ul>\n<p>Il est très facile de représenter l&#39;avancement global à partir d&#39;indicateurs d&#39;avancement par activité et sans forcement avoir besoin d&#39;en dire beaucoup sur l&#39;ordonnancement de ces activités: séquentiel, parallèle ou plus complexe. Cette tolérance/flexibilité n&#39;est pas éliminatoire car l&#39;&oelig;il humain ajoute automatiquement un contexte d&#39;interprétation: tout le monde sait bien qu&#39;il est souhaitable que le terrassement et la maçonnerie soient terminées avant que la peinture ne démarre. Ou qu&#39;il ne sert à rien d&#39;essayer de terminer le test fonctionnel alors que les spécifications ne sont pas achevées. Mais que l&#39;électricité et la plomberie peuvent très bien avancer en parallèle...</p>\n<center>\n<img src=\"/files/groupprojets12.png\" alt=\"\">\n</center>\n\n<p>Il y a trois façons de lire ce diagramme:</p>\n<ul>\n<li>horizontal: l&#39;avancement de chaque projet et le reste à faire par activité</li>\n<li>vertical: l&#39;avancement de chaque activité et le reste à faire par projet</li>\n<li>à l&#39;intersection: le reste à faire pour un projet x activité</li>\n</ul>\n"}}}
